dynamicMesh_basketball/002_cyclicAMI_run/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 1 0 0 );

boundaryField
{
    ball
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    inlet
    {
        type            fixedValue;
        value           uniform ( 1 0 0 );
    }
    outlet
    {
        type            zeroGradient;
    }
    out_wall
    {
        type            slip;
    }
    in_to_out
    {
        type            cyclicAMI;
        neighbourPatch  out_to_in;
    }
    out_to_in
    {
        type            cyclicAMI;
        neighbourPatch  in_to_out;
    }
}


// ************************************************************************* //
