dynamicMesh_basketball/002_cyclicAMI_run/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    in_to_out
    {
        type           cyclicAMI;
        machTolerance  1e-6;
        neighbourPatch out_to_in;
        transform      noOrdering;

    }
    out_to_in
    {
        type           cyclicAMI;
        machTolerance  1e-6;
        neighbourPatch in_to_out;
        transform      noOrdering;

    }
}

U
{
    boundaryField
    {   
        in_to_out
        {
            type            cyclicAMI;
            neighbourPatch  out_to_in;
        }
    
        out_to_in
        {
            type            cyclicAMI;
            neighbourPatch  in_to_out;
        }
    }
}
p
{
   boundaryField
    {   
        in_to_out
        {
            type            cyclicAMI;
            neighbourPatch  out_to_in;
        }
    
        out_to_in
        {
            type            cyclicAMI;
            neighbourPatch  in_to_out;
        }
    }
}
k
{
   boundaryField
    {   
        in_to_out
        {
            type            cyclicAMI;
            neighbourPatch  out_to_in;
        }
    
        out_to_in
        {
            type            cyclicAMI;
            neighbourPatch  in_to_out;
        }
    }
}
omega
{
   boundaryField
    {   
        in_to_out
        {
            type            cyclicAMI;
            neighbourPatch  out_to_in;
        }
    
        out_to_in
        {
            type            cyclicAMI;
            neighbourPatch  in_to_out;
        }
    }
}
nuTilda
{
   boundaryField
    {   
        in_to_out
        {
            type            cyclicAMI;
            neighbourPatch  out_to_in;
        }
    
        out_to_in
        {
            type            cyclicAMI;
            neighbourPatch  in_to_out;
        }
    }
}
nut
{
   boundaryField
    {   
        in_to_out
        {
            type            cyclicAMI;
            neighbourPatch  out_to_in;
        }
    
        out_to_in
        {
            type            cyclicAMI;
            neighbourPatch  in_to_out;
        }
    }
}

// ************************************************************************* //
